Repository: kcharymyrat/dj_evvoli
Catalog: locale/*/LC_MESSAGES/django.po
Languages: tk

source: Turkmen
tk: Türkmen

source: English
tk: Iňlis

source: Russian
tk: Rus

source: Provide only 8 digits, don't start with +993 or 8 6x
tk: Diňe 8 sany san giriziň, we +993 ýa-da 8 6x bilen başlamaň

source: Delivery Time*
tk: Eltip bermegiň wagty

source: Payment Options
tk: Töleg Şekili

source: cash
tk: nagt

source: card terminal
tk: bank karty

source: Full Name*
tk: Adyňyz*

source: Phone*
tk: Telefon belgiňiz*

source: Address*
tk: Salgyňyz*

source: Phone number must be entered in the format: '12345678'. Exactly 8 digits.
tk: Telefon belgisi '12345678' görnüşinde girizilmeli. 8 san.

source: products
tk: harytlar

source: cart price
tk: sebetiň bahasy

source: is ordered
tk: sargyt edilenmi

source: date added
tk: goşulan senesi

source: date modified
tk: üýtgedilen senesi

source: cart
tk: sebet

source: carts
tk: sebetler

source: Cart
tk: Sebet

source: manats
tk: manat

source: product
tk: haryt

source: quantity
tk: mukdary

source: cart item
tk: sebediň harydy

source: carts items
tk: sebediň harytlary

source: Product model
tk: Haryt modeli

source: pcs
tk: sany

source: Order
tk: Sargyt

source: Product Name
tk: Haryt ady

source: Product Model
tk: Haryt modeli

source: Price
tk: Bahasy

source: Quantity
tk: Mukdary

source: Order Item
tk: Sargydyň harydy

source: Order Items
tk: Sargydyň harytlary

source: status
tk: sargyt ýagdaýy

source: payment option
tk: töleg şekili

source: customer name
tk: müşderiniň ady

source: phone number
tk: telefon belgisi

source: 8 digits
tk: 8 sany san

source: delivery date and time
tk: Eltip berme senesi we wagty

source: shipping address
tk: eltip berme salgysy

source: total order price
tk: jemi sargyt bahasy

source: timestamp
tk: wagt belligi

source: order
tk: sargyt

source: orders
tk: sargytlar

source: Order price
tk: Sargyt bahasy

source: A new cart has been created for you.
tk: Siziň üçin täze sebet döredildi.

source: Required resolution of the image should be within
tk: Suratyň gerekli ölçeg aralygy

source: and
tk: we

source: Number of Products
tk: Hartylaryň sany

source: Make sure that your image is less than
tk: Suratyňyzyň görkezilenden ululykdan pesdigine göz ýetiriň

source: Please upload an image with a minimum resolution of
tk: Görkezilen ölçegden pes surat ýüklememegiňizi haýyş edýäris

source: pixels
tk: piksel

source: Please upload an image with a maximum resolution of
tk: Görkezilen ölçegden uly surat ýüklememegiňizi haýyş edýäris

source: Unsupported file type. Only mp4, mov, and mkv are supported.
tk: Goldanmaýan faýl görnüşi. Diňe mp4, mov we mkv goldaýar.

source: Make sure that your video is less than 20 MB.
tk: Wideoňyzyň 20 MB-dan azdygyna göz ýetiriň.

source: name (Turkmen)
tk: ady (Türkmençe)

source: name (English)
tk: ady (Iňlisçe)

source: name (Russian)
tk: ady (Rusça)

source: description (Turkmen)
tk: beýany (Turkmençe)

source: description (English)
tk: beýany (Iňlisçe)

source: description (Russian)
tk: beýany (Rusça)

source: image
tk: surady

source: created at
tk: döredilen wagty

source: modified at
tk: üýtgedilen wagty

source: created by
tk: tarapyndan döredildi

source: category
tk: kategoriýasy

source: categories
tk: kategoriýalary

source: type (Turkmen)
tk: görnüşi (Turkmençe)

source: type (English)
tk: görnüşi (Iňlisçe)

source: type (Russian)
tk: görnüşi (Rusça)

source: model
tk: modeli

source: title (Turkmen)
tk: ady (Turkmençe)

source: title (English)
tk: ady (Iňlisçe)

source: title (Russian)
tk: ady (Rusça)

source: price
tk: bahasy

source: sale percentage
tk: arzanladyş göterimi

source: sale price
tk: arzanladyşdan soňky bahasy

source: on sale
tk: arzanladyşda my

source: in stock
tk: ätiýaçda haryt barmy

source: video
tk: wideo

source: content (Turkmen)
tk: mazmuny (Turkmençe)

source: content (English)
tk: mazmuny (Iňlisçe)

source: content (Russian)
tk: mazmuny (Rusça)

source: product specification
tk: harydyň spesifikasiýasy

source: product specifications
tk: harydyň spesifikasiýalary

source: description
tk: beýany

source: product image
tk: harydyň surady

source: product images
tk: harydyň suratlary

source: About us
tk: Biz barada

source: About Evvoli Turkmenistan
tk: Evvoli Türkmenistan barada

source: Evvoli is a leading provider of innovative tech solutions. Our mission is to enhance the digital experience with cutting-edge products and services.
tk: Evvoli innowasion tehnologiýa çözgütleriniň öňdebaryjy üpjünçisidir. Biziň maksadymyz, öňdebaryjy önümler we hyzmatlar bilen sanly tejribäni ösdürmek.

source: Our Stores
tk: Dükanlarymyz

source: Ashgabat
tk: Aşgabat

source: Hoja Ahmet Yasawy St, Ashgabat 744000, Turkmenistan
tk: Hoja Ahmet Ýasasawy köçesi, Aşgabat 744000, Türkmenistan

source: Gundogar Bazar D3, Ashgabat 744000, Turkmenistan
tk: Gündogar Bazar D3, Aşgabat 744000, Türkmenistan

source: Phone
tk: Telefon belgimiz

source: Oguz Han, Mary, Turkmenistan
tk: Oguz Han köçesi, Mary ş., Turkmenistan

source: Find Us Here
tk: Biz şu ýerde

source: Products
tk: Harytlar

source: Product Specifications
tk: Harydyň Spesifikasiýalary

source: Add to Cart
tk: Sebede goşuň

source: Your browser does not support the video tag.
tk: Brauzeriňiz wideo belligini (video HTML tag) goldamaýar

source: OFFERS
tk: TEKLIPLER

source: ON SALE
tk: ARZANLANDYRYŞDA

source: PRODUCT TYPES
tk: HARYT GÖRNÜŞLERI

source: All products
tk: Hemmesi

source: PRICE RANGE
tk: BAHA ARALYGY

source: NEW
tk: TÄZE

source: Quick view
tk: Harydy gör

source: Details
tk: Maglumatlar

source: Product details
tk: Haryt maglumatlary

source: Oops!
tk: Ýalňyşlyk!

source: The server could not understand the request due to invalid syntax.
tk: Nädogry sintaksis sebäpli serwer haýyşa düşünip bilmedi.

source: Go Home
tk: Baş Sahypa

source: You don't have permission to access this page.
tk: Bu sahypa girmäge rugsadyňyz ýok.

source: Page Not Found
tk: Sahypa tapylmady

source: Opps!
tk: Ýalnyşlyk!

source: Page not found.
tk: Sahypa tapylmady.

source: The page you’re looking for doesn’t exist.
tk: Gözleýän sahypaňyz ýok.

source: Server Error
tk: Serwer ýalňyşlygy

source: Internal Server Error.
tk: Içerki Serwer ýalňyşlygy

source: Something went wrong on our end.
tk: Serwer tarap ýalňyşy

source: About Us
tk: Biz barada

source: 2024 Evvoli Turkmenistan. All rights reserved.
tk: 2024 Evvoli Türkmenistan. Ähli hukuklar goralandyr.

source: Get it on Google Play
tk: Google Play-dan ýükläň

source: Evvoli logo
tk: Evvoli nyşany

source: Menu
tk: Menü

source: Others
tk: Beýlekiler

source: Search
tk: Gözleg

source: See More
tk: Giňişleýin öwren

source: category image
tk: kategoriya surady

source: Home
tk: Baş Sahypa

source: AC
tk: Kondisioner

source: Italian quality for your home
tk: Italiýanyň hili siziň öýüňize

source: Evvoli ACs
tk: Kondisionerler

source: TV
tk: Telewizor

source: Evvoli - Choose the future
tk: Evvoli - Gelejegi saýla

source: Evvoli TVs
tk: Telewizorlar

source: Washing Machines
tk: Kir ýuwujy maşynlar

source: Europe begins with Evvoli
tk: Ýewropa Evvoli bilen başlaýar

source: Evvoli WMs
tk: Kir ýuwujy maşynlar

source: evvoli is...
tk: Evvoli

source: a consumer electronics brand that blends human-centric technology and neo-modern designs with excellent value. Our diversified range of electronics and technology products will inspire you to evolve for life.
tk: häzirki zaman ajaýyp dizaýyny bilen el ýeterli bahany birleşdirýän hojalyk tehnika markasydyr. Dürli hojalyk tehnikalarymyz täze özgerişlere ýetmäge ylham berer.

source: decorative image
tk: bezeg surady

source: a consumer electronics brand that blends human-centric technology and neo-modern designs with excellent value. Our diversified range of electronics and technology products will inspire you to evolve for life.
tk: häzirki zaman ajaýyp dizaýyny bilen el ýeterli bahany birleşdirýän hojalyk tehnika markasydyr. Dürli hojalyk tehnikalarymyz täze özgerişlere ýetmäge ylham berer.

source: Your Shopping Cart
tk: Sebediňiz

source: Kindly review the items in your basket and proceed to checkout at your earliest convenience. You may also adjust the quantity of your selected products as needed.
tk: Sargydyňyzy tamamlamak üçin aşakdaky töleg formasyny dolduryň. Siziň rahatlylygyňyz üçin wagtynda eltip barmäge çalyşýarys.

source: Cart Details
tk: Sebet Maglumatlary

source: TOTAL
tk: JEMI

source: Proceed to Checkout
tk: Dowam ediň

source: Your Cart
tk: Sebetiňiz

source: Order success
tk: Üstünlikli sargyt

source: Your cart is empty
tk: Sebetiňiz boş

source: Seems that you have not added anything to your cart. Please add the products to the cart.
tk: Sebetiňize hiç zat goşulmadyk. Sebete haryt goşmagyňyzy haýyş edýäris.

source: Home Page
tk: Baş Sahypa

source: Checkout form
tk: Sargyt formasy

source: Kindly fill out the checkout form below to conclude your order. We are dedicated to ensuring the most efficient and timely delivery service for your convenience.
tk: Sargydyňyzy tamamlamak üçin aşakdaky töleg formasyny dolduryň. Siziň rahatlylygyňyz üçin wagtynda eltip barmäge çalyşýarys.

source: Order Details
tk: Sargyt Maglumatlary

source: Your Order
tk: Sargydyňyz

source: No. of products
tk: Harytlaryň sany

source: Checkout
tk: Sargydyňyzy tamamlaň

source: Unable to Proceed with Order
tk: Sargyt goýmagy dowam etdirmek mümkin däl.

source: Your shopping cart is currently empty. It appears that no items have been added to your basket yet. Please select the products you wish to purchase and add them to your basket to continue.
tk: Sebetiňiz boş. Sebetiňize entäk hiç zat goşulmandyr. Satyn almak isleýän harytlaryňyzy saýlaň we dowam etdirmek üçin sebetiňize goşuň.

source: Thank you for your Order!
tk: Sargydyňyz üçin sag boluň!

source: Your order has been placed successfully and is being processed.
tk: Sargydyňyz üstünlikli ýerleşdirildi we işlenýär.

source: Order Details:
tk: Sargyt Maglumatlary:

source: Order Number
tk: Sargyt Nomeri

source: Order Total
tk: Sargyt Jemi

source: You will be contacted by our team for the delivery details.
tk: Sargydyňyzy eltip bermek üçin Siz bilen habarlaşarys.

source: Continue Shopping
tk: Dowam etmek
